# Brewfile

# taps
tap 'homebrew/bundle'
tap 'homebrew/services'
tap 'boz/repo'
tap 'mike-engel/jwt-cli'
tap 'hashicorp/tap'

# Install apps in macos Applications directory
cask_args appdir: '/Applications'

brew 'azure-cli'
brew 'base64'
brew 'bat'
brew 'bitwarden-cli'
brew 'bottom'
brew 'boz/repo/kail'
brew 'cookiecutter'
brew 'coreutils'
brew 'curl'
brew 'fd'
brew 'findutils'
brew 'fzf'
brew 'gabrie30/utils/ghorg'
brew 'git'
brew 'git-extras'
brew 'git-filter-repo'
brew 'glow'
brew 'gnu-sed'
brew 'gnupg'
brew 'gnutls'
brew 'go-task'
brew 'grep'
brew 'hashicorp/tap/terraform'
brew 'helm'
brew 'jq'
brew 'jwt-cli'
brew 'k6'
brew 'k9s'
brew 'kcat'
brew 'ktlint'
brew 'kubectl'
brew 'kubectx'
brew 'kustomize'
brew 'lazydocker'
brew 'lazygit'
brew 'lua'
brew 'luarocks'
brew 'magic-wormhole'
brew 'nano'
brew 'node'
brew 'npm'
brew 'nvim'
brew 'ollama'
brew 'openssl'
brew 'pipenv'
brew 'pipx'
brew 'postgis'
brew 'postgresql@16'
brew 'protobuf'
brew 'pyenv'
brew 'ranger'
brew 'ripgrep'
brew 'shellcheck'
brew 'starship'
brew 'stow'
brew 'stylua'
brew 'telnet'
brew 'tflint'
brew 'tldr'
brew 'trash'
brew 'tree'
brew 'watch'
brew 'wget'
brew 'wrk'
brew 'yarn'
brew 'yq'
brew 'zoxide'
brew 'zsh'
brew 'zsh-autosuggestions'
brew 'zsh-completions'
brew 'zsh-syntax-highlighting'

# Casks
cask 'alacritty'
cask 'bluesnooze'
cask 'caffeine'
cask 'calibre'
cask 'docker'
cask 'firefox'
cask 'firefox@developer-edition'
cask 'font-fira-code'
cask 'font-fira-mono-nerd-font'
cask 'font-hack-nerd-font'
cask 'font-iosevka'
cask 'font-iosevka-nerd-font'
cask 'font-iosevka-term-nerd-font'
cask 'iterm2'
cask 'jetbrains-toolbox'
cask 'keepassxc'
cask 'keymapp'
cask 'microsoft-office'
cask 'microsoft-teams'
cask 'obsidian'
cask 'raycast'
cask 'slack'
cask 'spotify', args: { require_sha: false }
cask 'ticktick'
cask 'visual-studio-code'
cask 'vivaldi'
cask 'warp'
cask 'wezterm'

# Under test
cask 'appcleaner'
brew 'redis'
cask 'jdk-mission-control'
cask 'visualvm'
brew 'gum'

# Python: managed by pip, pipx and pyenv
# https://raw.githubusercontent.com/itzalak/anvil/e868cb0d84777c6b15d9551ea3617a61f5aa2981/taskfiles/taskfile.python.yml

# Java: managed by sdkman
# https://raw.githubusercontent.com/itzalak/anvil/e868cb0d84777c6b15d9551ea3617a61f5aa2981/taskfiles/taskfile.sdkman.yml

# Terraform
# terraform and tfenv conflict if both are installed
# brew 'tfenv'
# brew 'tfsec'


# Unused
# brew 'httpie'
# cask 'chromium'
# cask 'postman'
# cask 'insomnia'
